Revit 2024 API
FabricSheet.IsValidHost Method (Document, ElementId)
 Checks whether an element is a valid host for fabric sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsValidHost(
	Document document,
	ElementId concreteHostElementId
)
Visual Basic
Public Shared Function IsValidHost ( _
	document As Document, _
	concreteHostElementId As ElementId _
) As Boolean
Visual C++
public:
static bool IsValidHost(
	Document^ document,
	ElementId^ concreteHostElementId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
concreteHostElementId
Type: Autodesk.Revit.DB.ElementId
 The elementId to check.
Return Value
 True if the element is a valid host for fabric sheet, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricSheet Class
IsValidHost Overload
Autodesk.Revit.DB.Structure Namespace